app/views/fixtures/show.html.erb

SELECT "predicts".* FROM "predicts" WHERE "predicts"."fixture_id" = 10
---
<div class="span6">
		<% @predicts = Predict.where(:fixture_id => @fixture.id) %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
			<tr>
				<td><%= User.find(u).name %></td>