app/views/scoreboards/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---

          <td><%= User.find(@record.second).name  %></td>