app/views/scoreboards/index.html.erb


        <% @users = User.all %>
---
SELECT "users".* FROM "users"

          <td><center>
          <%= Scoreboard.where(:user_id => user.id).pluck(:matchscore).sum %>
---
SELECT SUM("scoreboards"."matchscore") AS sum_id FROM "scoreboards" WHERE "scoreboards"."user_id" = 1