app/views/scoreboards/summary.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
<h3>	<% m = user_id %>
	<% if User.find(m).name == "pethl" %>

SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = $1 ORDER BY fixtures.matchdate ASC LIMIT 1  [["id", 3]]
---
    <td><% f = scoreboard.fixture_id %>
			<%= Fixture.find(f).hometeam %> - <%= Fixture.find(f).match %></td>