app/views/users/show.html.erb


	<% if @user.matchpicks.where(:reason => "Scores").any? %>
---
SELECT "matchpicks".* FROM "matchpicks" WHERE "matchpicks"."user_id" = 1
SELECT COUNT(*) FROM "matchpicks" WHERE "matchpicks"."user_id" = 1 AND "matchpicks"."reason" = 'Scores'


		<% @predicts = Predict.where(:matchpick_id => matchpick.id).order(:id) %>
---
SELECT "predicts".* FROM "predicts" WHERE "predicts"."matchpick_id" = 1 ORDER BY id

			<tr>
			<td><center><%= Fixture.find(r).match %><br><strong><%= Fixture.find(r).city %></strong>
---
SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = $1 ORDER BY fixtures.matchdate ASC LIMIT 1  [["id", 7]]