app/controllers/fixtures_controller.rb

SELECT "fixtures".* FROM "fixtures" ORDER BY fixtures.matchdate ASC, id ASC
---
  def index
    @fixtures = Fixture.order("id ASC")

SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = $1 ORDER BY fixtures.matchdate ASC LIMIT 1  [["id", "10"]]
---
  def show
    @fixture = Fixture.find(params[:id])