app/controllers/scoreboards_controller.rb

  def index

    @scoreboards = Scoreboard.order("user_id ASC")
    @scoreboards_user = @scoreboards.group_by { |t| t.user_id }
---
SELECT "users".* FROM "users"