app/controllers/scoreboards_controller.rb

SELECT SUM("scoreboards"."matchscore") AS sum_id FROM "scoreboards" WHERE "scoreboards"."user_id" = 1
---
  def index

    @scoreboards = Scoreboard.sum(:matchscore, :group => "user_id").invert.sort

SELECT "scoreboards".* FROM "scoreboards" ORDER BY user_id ASC
SELECT "fixtures".* FROM "fixtures" ORDER BY fixtures.matchdate ASC
---
  def summary
      @scoreboards = Scoreboard.order("user_id ASC")
       @scoreboards_user = @scoreboards.group_by { |t| t.user_id }
           @fixtures = Fixture.all

SELECT "scoreboards".* FROM "scoreboards" WHERE "scoreboards"."id" = $1 LIMIT 1  [["id", "21"]]
---
  def show
    @scoreboard = Scoreboard.find(params[:id])

SELECT "scoreboards".* FROM "scoreboards" WHERE "scoreboards"."id" = $1 LIMIT 1  [["id", "21"]]
---
  def edit
    @scoreboard = Scoreboard.find(params[:id])

SELECT "scoreboards".* FROM "scoreboards" WHERE "scoreboards"."id" = $1 LIMIT 1  [["id", "21"]]
UPDATE "scoreboards" SET "matchscore" = 1, "comments" = '', "updated_at" = '2013-07-01 12:09:06.098332' WHERE "scoreboards"."id" = 21
---
  def update
    @scoreboard = Scoreboard.find(params[:id])

    respond_to do |format|
      if @scoreboard.update_attributes(params[:scoreboard])