app/controllers/squads_controller.rb

  def index
    @squads = Squad.all
---
SELECT "squads".* FROM "squads" ORDER BY squads.position ASC